posts/2018-06-12-google-cloud-f-gfw/index.html
<!DOCTYPE html>
<html>
	<head>
		<meta charset="utf-8">
		<meta name="viewport" content="width=device-width">
		

		<title>Google Cloud安装Shadowsocks</title>

		
		<link rel="stylesheet" href="https://www.young40.com/css/colors-dark.min.14df29dc468d31c46cb59a9b259c6e5c1623b01cee7d55d63f81e588d3496fc6.css">


	</head>
	<body>
		<header id="header">
			<h1><a href="https://www.young40.com/">杨世玲的博客</a></h1>
			<p></p>
		</header>

		<div id="page">
			<div id="sidebar">
				<nav>
	
		<ul class="nav">
			
				<li><a href="/"><span>Home</span></a></li>
			
				<li><a href="/index.xml"><span>RSS</span></a></li>
			
				<li><a href="/tags"><span>Tags</span></a></li>
			
				<li><a href="/categories"><span>分类</span></a></li>
			
				<li><a href="/hexoblog/"><span>历史文章</span></a></li>
			
		</ul>
	
</nav>

			</div>

			<div id="content">
				
	<article class="post">
		<h1><a href="https://www.young40.com/posts/2018-06-12-google-cloud-f-gfw/">Google Cloud安装Shadowsocks</a> </h1>

		<div class="post-content"><p>
Google Cloud一直在搞首年送300美金的活动, 顺手薅了下羊毛, 记录一下重点过程.</p>
<div id="outline-container-headline-1" class="outline-5">
<h5 id="headline-1">
防火墙配置
</h5>
<div id="outline-text-headline-1" class="outline-text-5">
<p>找到防火墙配置, 创建一条新的防火墙规则. 重点配置如下:</p>
<ul>
<li>
<p>目标: 网络中的所有实例</p>
</li>
<li>
<p>来源IP地址范围: 0.0.0.0/0</p>
</li>
<li>
<p>协议和端口: 指定协议和端口 tcp:8888</p>
</li>
</ul>
<p>解释一下:</p>
<ul>
<li>
<p>目标, 可以应用到所有的实例, 这样再开其他地区实例可以直接应用当前的防火墙配置</p>
</li>
<li>
<p>来源IP地址范围, 允许所有的IP连接</p>
</li>
<li>
<p>协议端口, 开启了Shadowsocks的端口, 需要和自己的配置对上. 我看网络上好多人的配置基本是都是允许了所有的端口连接, 这样非常不安全, 还是需要按需开放才够安全.</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-5">
<h5 id="headline-2">
地区选择
</h5>
<div id="outline-text-headline-2" class="outline-text-5">
<p>我开启了两个实例, 分别选择的是台湾省(asia-east1-c)和新加坡(asia-southeast1-c). </p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-5">
<h5 id="headline-3">
创建实例
</h5>
<div id="outline-text-headline-3" class="outline-text-5">
<p>创建实例, 选择乞丐版, 镜像选Ubuntu 18.04 LTS, 输入本机的SSH密钥. 启动之后会分配一个临时IP, 在网络中将这个IP改成静态IP.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-5">
<h5 id="headline-4">
初步配置
</h5>
<div id="outline-text-headline-4" class="outline-text-5">
<ul>
<li>
<p>修改当前账户密码</p>
</li>
</ul>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo passwd</code></pre></div>
<ul>
<li>
<p>安装zsh和oh my zsh</p>
</li>
</ul>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo apt-get install zsh</code></pre></div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-5">
<h5 id="headline-5">
开启BBR支持
</h5>
<div id="outline-text-headline-5" class="outline-text-5">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo echo <span style="color:#e6db74">&#34;net.core.default_qdisc=fq&#34;</span> &gt;&gt; /etc/sysctl.conf
sudo echo <span style="color:#e6db74">&#34;net.ipv4.tcp_congestion_control=bbr&#34;</span> &gt;&gt; /etc/sysctl.conf
<span style="color:#75715e"># 让设置生效</span>
sysctl -p
<span style="color:#75715e"># 检查设置是否生效</span>
lsmod | grep bbr</code></pre></div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-5">
<h5 id="headline-6">
软件升级
</h5>
<div id="outline-text-headline-6" class="outline-text-5">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo apt-get update <span style="color:#f92672">&amp;&amp;</span> sudo apt-get upgrade</code></pre></div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-5">
<h5 id="headline-7">
安装Shadowsocks
</h5>
<div id="outline-text-headline-7" class="outline-text-5">
<ul>
<li>
<p>安装</p>
</li>
</ul>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo apt-get install shadowsocks-libev</code></pre></div>
<ul>
<li>
<p>配置</p>
</li>
</ul>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">sudo vim /etc/shadowsocks-libev/config.json</code></pre></div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-5">
<h5 id="headline-8">
检查状态
</h5>
<div id="outline-text-headline-8" class="outline-text-5">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">systemctl status shadowsocks-libev.service</code></pre></div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-5">
<h5 id="headline-9">
收工
</h5>
<div id="outline-text-headline-9" class="outline-text-5">
<p>愉快地F*** GFW吧!</p>
</div>
</div></div>

		<p class="meta">Posted on <span class="postdate">12. June 2018</span></p>
	</article>

			</div>

			<footer id="footer">
				<p class="copyright">
					
						© 2019 Copyright 杨世玲
					
				</p>
			</footer>
		</div>

		
	</body>
</html>
